lib/tasks/admin.rake

INSERT INTO "users" ("email", "password_digest", "name", "address", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@secondspark.com"], ["LIMIT", 1]]
---
  task create_admin: :environment do
    admin = User.find_or_create_by(email: 'admin@secondspark.com') do |user|