app/views/shared/_search_form.html.erb

SELECT "categories"."name", "categories"."id" FROM "categories" WHERE "categories"."active" = ?  [["active", 1]]
---
      <div class="col-md-3">
        <%= form.select :category_id,
            options_for_select([['All Categories', '']] +
                              Category.active.pluck(:name, :id),
                              params[:category_id]),
            {},
            { class: "form-select" } %>