app/controllers/home_controller.rb

  def index
    @featured_products = Product.active.in_stock.limit(8)
---
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND (quantity > 0) LIMIT ?  [["active", 1], ["LIMIT", 8]]