app/controllers/products_controller.rb

  def index
    @products = Product.active.includes(:category, :reviews)
    @products = @products.by_category(params[:category_id]) if params[:category_id].present?
    @products = @products.by_condition(params[:condition]) if params[:condition].present?
    @products = @products.where("name LIKE ?", "%#{params[:search]}%") if params[:search].present?
    @products = @products.limit(12)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 16], ["id", 17], ["id", 18]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "categories"."name", "categories"."id" FROM "categories" WHERE "categories"."active" = ?  [["active", 1]]
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND "products"."category_id" = ? LIMIT ? OFFSET ?  [["active", 1], ["category_id", 18], ["LIMIT", 12], ["OFFSET", 0]]

  def show
    @related_products = Product.active.where(category: @product.category)
                              .where.not(id: @product.id)
                              .limit(4)
---
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND "products"."category_id" = ? AND "products"."id" != ? LIMIT ?  [["active", 1], ["category_id", 17], ["id", 35], ["LIMIT", 4]]

  def set_product
    @product = Product.active.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND "products"."id" = ? LIMIT ?  [["active", 1], ["id", 29], ["LIMIT", 1]]